#include <stdio.h>
#include <locale.h>
void time(void)
{
	int k = 2;
	setlocale(LC_ALL, "RUS");
	printf("Моя\n\t%d\n\t\tпрограмма",k);
	printf("%10.5f\n ", 12.234657);
	printf("Остаток от деления %d на %d равен %d\n ", 7, 5, 7 % 5);
	printf("Результат умножения %d на %d равен %d\n ", 2000, 4, 2000 * 4);
	printf("%.1f получается при делении %.1f на %.1f\n", 5. / 2, 5., 2.);
	printf("%.d получается при умножении %.d на %d на %d\n", 2000 * 4 * 3, 2000, 4, 3);

}
void main(void)
{
	setlocale(LC_ALL, "RUS");
	int N = 16;
	int k = 10;
	printf("Сейчас %d часов %d минут 00 секунд\n", N, k);
	printf("Идет %d минута суток\n",(N * 60)+10);
	printf("До полуночи осталось %d часов и %d минут\n", (N/2), 0);
	printf("С 8.00 прошло %d секунд\n",((N/2)*3600 + 6000));
	printf("Текущий час = %.1f суток и текущая минута %.1f/60 часа\n", N/23., k/60.);
}